Repository: benny856694/attendance
Catalog: huaanClient/Properties/Strings.*.resx
Languages: fr, ja, ru, vi

# AllDriveIsNotAvailable
source: 没有可用的磁盘，无法保存数据
fr: Impossible d'enregistrer les données sans disque disponible
ja: 利用可能なディスクがありません。データを保存できません。
ru: Драйвер для хранения данных отсутствует
vi: Không có đĩa để lưu dữ liệu

# TakePicture
source: 拍照
fr: Prendre des photos
ja: 写真を撮る
ru: Сделать фото
vi: Chụp ảnh

# Camera
source: 相机
fr: Caméra
ja: カメラ
ru: Камера
vi: máy ảnh

# PromptSwitchingCamera
source: 正在切换...
fr: Commutation...
ja: 切り替え中..
ru: Подключение...
vi: Chuyển

# Switch
source: 切换
fr: Basculer
ja: 切り替え
ru: Подключить
vi: công

# StaffCodeExists
source: 员工编号已经存在
fr: Le numéro d'employé existe déjà
ja: ユーザー番号は既に存在します
ru: Номер сотрудника уже существует
vi: Số nhân viên đã có

# StaffCodeIsEmpty
source: 员工编号不能为空
fr: Le numéro d'employé ne peut pas être vide
ja: ユーザー番号は空にしてはいけません
ru: Номер сотрудника не должен быть пустым
vi: Số nhân viên không thể trống

# StaffImageInValid
source: 照片不合符要求
fr: Photo non valable
ja: 写真は要求に合いません
ru: Невозможно использовать это фото
vi: Tấm ảnh không đáp ứng yêu cầu

# SaveFailed
source: 保存失败
fr: Enregistrer avec succès
ja: 保存に失敗しました
ru: Неудалось выполнить сохранение
vi: Lỗi lưu

# SaveSuccess
source: 保存成功
fr: Échec de l'enregistrement
ja: 保存に成功しました
ru: Сохранение выполнено успешно
vi: Lưu thành công

# Absent
source: 旷工
fr: Absence
ja: 無届け欠勤
ru: Да
vi: Vắng

# AttendanceNames
source: 姓名,部门,员工编号,考勤日期,上班打卡,下班打卡,上班打卡2,下班打卡2,班次信息,应出勤时间(小时),迟到(分钟),早退(分钟),加班(分钟),是否旷工,体温
fr: Nom,Département,numéro de l'employé,date de présence,horloge au travail,horloge au travail,horloge au travail 2,horloge au travail 2,information sur le poste,heure de présence requise (heures),retard (minutes),départ anticipé (minutes),heures supplémentaires (minutes),absentéisme,température corporelle
ja: 名前,部門,社員番号,出勤日,出勤カード,退勤カード,出勤カード2,退勤カード2,便情報,出勤時間(時間),遅刻(分),早退(分),残業(分),欠勤,体温
ru: Имя,Отдел,Номер сотрудника,Дата посещения,Время входа,Время выхода,Время входа 2,Время выхода 2,Информация о смене,Время посещения (часы),Опаздания (минуты),Уход раньше конца смены (минуты),Задержка на работе (минуты),Контроль опазданий,Температура тела
vi: Tên,Bộ phận,Số nhân viên,Ngày tham dự,Giờ vào,Giờ ra,Giờ vào 2,Giờ ra 2,Thông tin ca làm việc,Thời gian tham dự (giờ),Muộn (phút),Nghỉ sớm (phút),Làm thêm giờ (phút),Vắng mặt,Nhiệt độ cơ thể

# DayOff
source: 请假
fr: Congé
ja: 休暇をとる
ru: Да
vi: nghỉ

# ImageMissing
source: 图片缺失
fr: Image manquante
ja: 画像がありません
ru: Отсутствует изображение
vi: Thiếu ảnh

# DeviceOffline
source: 设备离线
fr: Équipement hors ligne
ja: 設備がオフラインする
ru: Устройство не в сети
vi: Thiết bị tắt

# StaffNames
source: 姓名,邮箱地址,电话号码,员工编号,照片路径,添加日期,身份证号码,门禁卡号,门禁卡号位数,部门,员工分类,自定义,性别,属性1,属性2,属性3,属性4,属性5
fr: Nom,adresse électronique,numéro de téléphone,numéro d'employé,chemin de la photo,date d'ajout,numéro de carte d'identité,numéro de carte d'accès,numéro de carte d'accès,Ministère,classification des employés
ja: 名前,メールアドレス,電話番号,従業員番号,写真経路,日付,身分証番号,ゲートカード番号,ゲートカード番号の桁数,部門,従業員の分類,customer_text,sex,extra1,extra2,extra3,extra4,extra5
ru: Имя,Email,Номер телефона,Номер сотрудника,Фото,Дата создания,ID номер,Номер карты доступа,Срок службы карты,Отел,Должность,Пользовательский текст,sex,extra1,extra2,extra3,extra4,extra5
vi: Tên,Email,Số điện thoại,Số nhân viên,Đường dẫn ảnh,Ngày tạo,Số ID,Số thẻ kiểm soát truy cập,Độ dài thẻ kiểm soát truy cập,Bộ phận,Loại nhân viên,sex,extra1,extra2,extra3,extra4,extra5

# InitializingDb
source: 初始化数据库
fr: Initialisation de la base de données...
ja: データベースの初期化.
ru: Подготовка к работе базы данныз...
vi: Đang khởi tạo cơ sở dữ liệu ...

# InitializeDbFailed
source: 初始化数据库错误
fr: Erreur d'initialisation de la base de Erreur d'initialisation de la base de données
ja: データベースエラーの初期化
ru: Ошибка создания базы данных
vi: Lỗi khởi tạo cơ sở dữ liệu

# LoginInProgress
source: 正在登录...
fr: Connectez - vous...
ja: ログイン.
ru: Вход...
vi: Đăng nhập...

# LoginSucceed
source: 登录成功
fr: Connexion réussie
ja: ログイン成功
ru: Вход выполнен успешно
vi: Đăng nhập thành công

# LoginFailed
source: 登录失败
fr: Échec de la connexion
ja: ログイン失敗
ru: Не удалось войти
vi: Đăng nhập thất bại

# ConnectDbFailed
source: 连接数据库失败: {0}
fr: Impossible de se connecter à la base de données: {0}
ja: 接続失敗データベース: {0}
ru: Не удалось подключиться к базе данных: {0}
vi: Kết nối Cơ sở dữ liệu không thành công: {0}

# UsernameOrPasswordIncorrect
source: 用户名或者密码错误
fr: Mauvais nom d'utilisateur ou mot de passe
ja: ユーザ名またはパスワードエラー
ru: Неверное имя пользователя или пароль
vi: Tên người dùng hoặc lỗi mật khẩu

# UsernameEmpty
source: 用户名不能为空
fr: Le nom d'utilisateur ne peut pas être vide
ja: ユーザ名は空にできません
ru: Имя пользователя не может быть пустым
vi: Tên người dùng không được để trống

# PasswordEmpty
source: 密码不能为空
fr: Le mot de passe ne peut pas être vide
ja: パスワードを空にすることはできません
ru: Пароль не может быть пустым
vi: Mật khẩu không được để trống

# ExceptionOccurred
source: 发生错误：{0}
fr: Anomalie: {0}
ja: 異常: {0}
ru: Исключение: {0}
vi: Ngoại lệ: {0}

# ChangePassword
source: 修改密码
fr: Modifier le mot de passe
ja: パスワード変更
ru: Изменить пароль
vi: Đổi mật khẩu

# ConfirmNewPassword
source: 确认新密码
fr: Confirmer le nouveau mot de passe
ja: 新しいパスワードの確認
ru: Подтвердить новый пароль
vi: Xác nhận mật khẩu mới

# ConfirmNewPasswordMismatch
source: 两次输入的新密码不同
fr: Le nouveau mot de passe ne correspond pas
ja: 新しいパスワードが一致しません
ru: Новый пароль не совпадает
vi: Mật khẩu mới không khớp

# NewPassword
source: 新密码
fr: Nouveau mot de passe
ja: 新しいパスワード
ru: Новый пароль
vi: Mật khẩu mới

# NewPasswordCanotBeSameAsOld
source: 新密码不能和旧密码相同
fr: Le nouveau mot de passe est le même que l'ancien mot de passe
ja: 新しいパスワードは古いパスワードと同じです
ru: Новый пароль должен отличаться от старого
vi: Mật khẩu mới giống với mật khẩu cũ

# RememberPassword
source: 记住密码
fr: Rappelez - vous le mot de passe.
ja: パスワードを覚えて
ru: Запомнить пароль
vi: Nhớ mật khẩu

# CaptureDataExportDefaultFileName
source: 抓拍记录
fr: Dossiers de présence
ja: 出席記録
ru: Звхват видео
vi: danh sách tham dự

# CaptureRecordColumnNames
source: 姓名,ID,设备名称,刷卡时间,对比分数,门禁卡号,比对失败原因,是否佩戴口罩,体温,设备序列号,证件编号,证件姓名,自定义,行程信息,抓拍图片路径
fr: Nom,ID,Nom du matériel,Temps de lecture de la carte,Score de comparaison,Numéro de la carte de contrôle d'accès,Raison de l'échec de la comparaison,Portez - vous un masque?,Température corporelle,Numéro de série du dispositif,Numéro du certificat,Nom du certificat,Statut du Code de santé,Informations sur l'itinéraire,Chemin de capture d'image
ja: 名前,ID,デバイス名,カードの時間,比較点,ゲートカード番号,失敗の原因に対して,マスクをしていますか,体温,デバイスシリアル番号,証明書番号,証明書の名前,健康コードの状態,ストローク情報,写真の撮り方
ru: Полное имя,ID,Название устройства,Время входа,Количество проходов,Номер карты доступа,Количество неудавшихся попыток прохода,Маска,Температура,Серийный номер устройства,Номер ID карты,Название ID карты,Состояние,Путь к информации,Путь к изображению
vi: tên đầy đủ,ID,Tên trang bị,Thời gian thẻ tín dụng,Điểm tương phản,Số thẻ truy cập,Lý do gây thất bại,Anh có đeo mặt nạ không?,Nhiệt,Số seri Thiết bị,Số chứng nhận,Tên của chứng nhận,Hệ thống Y tế,Thông tin mật,Vẽ đường dẫn

# Yes
source: 是
fr: C'est exact.
ja: はい
ru: Да
vi: Phải.

# ExportFileFailedWithError
source: 导出文件失败：{0}
fr: Impossible d'exporter le fichier: {0}
ja: ファイルのエクスポートに失敗しました: {0}
ru: Не удалось экспортировать файл: {0}
vi: Lỗi xuất tập tin: {0}

# ExportFileSucceed
source: 导出文件成功
fr: Exporter le fichier avec succès
ja: ファイルのエクスポートに成功しました
ru: Файл экспортирован
vi: Xuất tập tin thành công

# ExcelFile
source: Excel文件 (*.xlsx)|*.xlsx
fr: Fichier Excel (*.xlsx)|*.xlsx
ja: エクセルファイル (*.xlsx)|*.xlsx
ru: Excel File (*.xlsx)|*.xlsx
vi: Xoá tập tin (*.xlsx)|*.xlsx

# No
source: 否
fr: Non
ja: いいえ、
ru: Нет
vi: không

# AttendanceDataMonthlyNames
source: 姓名,用户编码,部门,员工编号,考勤日期,出勤(天),迟到次数/总时长(分钟),早退次数/总时长(分钟),旷工天数,请假天数
fr: Nom,Code d'utilisateur,Ministère,numéro d'employé,date de présence,présence (jour),temps de retard / durée totale (minutes),temps de départ anticipé / durée totale (minutes),jours d'absence,jours de congé
ja: 名前,ユーザーコード,部門,従業員番号,勤務時間,出勤（日）,遅刻回数/総時間長（分）,早退回数/総時間長（分）,欠勤日数,休暇日数
ru: Имя,Код пользователя,отдел,Номер сотрудника,Дата посещения,Посещение (день),Количество опазданий / общее время (минуты),Количество ранних уходов / общее время (минуты),Дни опаздания,Дни пропуска
vi: tên đầy đủ,Mã người dùng,Bộ,Số nhân viên,Ngày tham dự,Tham dự (ngày),Số lần trễ/ toàn bộ thời gian (phút),Thời gian nghỉ sớm/ toàn bộ (phút),Ngày vắng mặt,Nghỉ phép

# AttendanceDataMonthlyExportFileName
source: 月度考勤报表
fr: Rapport mensuel de présence
ja: 月間勤務評定表
ru: Ежемесячный отчет о посещаемости
vi: Báo cáo tham dự tháng

# ExcelCantBeAccessed
source: 无法打开文件，请确保文件没有被其他程序打开
fr: Impossible d'ouvrir le fichier, assurez - vous qu'il n'est pas ouvert par un autre programme
ja: ファイルを開くことができない、それが他のプログラム
ru: Файл не может быть открыт, убедитесь, что он не открыт другой программой
vi: Không mở được t ập tin, đảm bảo nó không được mở bởi chương trình khác.

# ExcelImportLogFileName
source: 批量导入结果
fr: Journal d'importation par lots
ja: バッチ輸入のログ
ru: Загрузить файл Excel
vi: Sản phẩm phụ gốc

# ExcelIsEmpty
source: 文件为空
fr: Le fichier est vide
ja: ファイルが空です
ru: Файл пуст
vi: tập tin rỗng

# Fail
source: 失败
fr: Échec
ja: 失敗
ru: Неудачно
vi: hỏng

# MessageSaveImportLog
source: 导入成功:{0},失败:{1}，是否保存导入结果？
fr: Le succès{0},l’échec:{1}, Enregistrer le Journal d'importation?
ja: 成功:{0},失敗:{1}, インポートログを保存?
ru: Успешно:{0},Неудачно:{1}, Сохранить место импорта?
vi: Thành công:{0},Thất bại:{1}, Lưu bản nhập khẩu?

# Success
source: 成功
fr: Succès
ru: Успешно
vi: thành công

# SrcStaffTemplateFileName
source: TemplateZn.xlsx
fr: TemplateEn.xlsx
ja: TemplateJap.xlsx
ru: TemplateEn.xlsx
vi: TemplateEn.xlsx

# DefaultCustomerText
source: 自定义内容
ru: текст клиента по умолчанию

# BatchImportModel
source: 批量导入模板
fr: BatchImportModel
ja: BatchImportModel
ru: BatchImportModel
vi: BatchImportModel

# BatchImportResult
source: 批量导入结果
fr: BatchImportResult
ja: BatchImportResult
ru: BatchImportResult
vi: BatchImportResult

# StaffExportExcelName
source: 人员信息
ru: Список сотрудников
vi: Danh sách nhân sự

# PhotoTakenNotQualified
source: 图片不合法，图片必须满足正面且只有唯一人脸
ja: 写真は合法的ではなく、正面を満たす必要があります。しかも唯一の顔しかありません
ru: Изображение не соответствует требованиям, убедитесь, что на изображении только одно лицо
vi: Hình ảnh được chụp không đủ tiêu chuẩn, hãy đảm bảo chỉ có một khuôn mặt trong ảnh và khuôn mặt đó hướng về phía máy ảnh

# DefaultEmployeeType
source: 其它
ja: その他の職種
ru: Другое
vi: Khác

# DefaultShiftName
source: 班次
ja: 便数
ru: Смена
vi: Ca

# DefaultCompanyName
source: 组织机构名称
ja: テスト会社
ru: Название кампании
vi: tên công ty

# DefaultDepartmentName
source: 下属组织机构
ja: 下部部門
ru: Отдел
vi: phòng ban

# DefaultShiftGroupName
source: 默认考勤组
fr: Groupe de présence par défaut
ja: 黙認出席組
ru: Название группы смен по умолчанию
vi: nhóm ca

# MenuItemCopyImage
source: 复制
fr: La reproduction
ja: コピー
ru: Копировать
vi: Sao chép

# ShowInExplorer
source: 显示在资源管理器中
fr: Afficher dans l’explorateur
ja: リソースマネージャに表示されます
ru: Посмотреть в Explorer
vi: Hiển thị trong Explorer

# DatasetIsTooBig
source: 要导出的数据超过10000条
fr: Les données à exporter sont vides
ja: 導き出すデータは空
ru: Максимальное количество 10000 символов
vi: Tập dữ liệu không được vượt quá 10000 mục

# NoDataFound
source: 要导出的数据为空
fr: Les données à exporter sont vides
ja: 導き出すデータは空
ru: Нет данных
vi: Không tìm thấy dữ liệu

# PhotoCaptureFailed
source: 拍照失败，请重试
fr: Échec de la photo, veuillez réessayer
ja: 写真を撮るのに失敗したらやり直してください
ru: Неудалось сделать фото, повторите попытку
vi: Lỗi chụp ảnh, xin hãy thử lại.

# AttendanceNameCanBeNotNull
source: 考勤组名称不能为空！
fr: Le nom du groupe de présence ne peut pas être vide
ja: 出席組の名前を空欄にしてはいけない!
ru: Название групп посещаемости не может быть пустым
vi: Tên nhóm không phải là trống rỗng!

# PasswordSpace
source: 不能输入空格
fr: Aucun espace ne peut être entré
ja: フレームを入力できない
ru: В пароле не должно быть пробелов
vi: Không thể nhập không gian

# DeleteFailed
source: 删除失败
fr: Suppression échouée
ja: 削除失敗
ru: Не удалось удалить
vi: Xóa lỗi

# PleaseRemoveShiftFromAttendanceGroup
source: 该班次已被使用，请先在考勤组移除该班次！
fr: Ce poste a déjà été utilisé. Veuillez d’abord le supprimer dans la section de présence!
ja: 当便は既に使用されておりますので、当直便から外してください。
ru: Эти смены уже используются, пожалуйста, сначала удалите эти смены из группы посещаемости!
vi: Các chuyến bay đã được sử dụng, xin vui lòng loại bỏ các chuyến bay trong nhóm làm việc!

# TimeOut
source: 超时
ja: タイムアウト
ru: Время вышло
vi: hết giờ

# AttendanceMasterDept
source: Dept
ru: Департамент
vi: Bộ phận

# AttendanceMasterDesig
source: Desig
ru: Дизайн
vi: Chức vụ

# AttendanceMasterIn
source: In
ru: В
vi: Giờ vào

# AttendanceMasterLate
source: Late
ru: Опаздание
vi: Trễ

# AttendanceMasterOT
source: OT
ru: Вр.раб.
vi: Tăng ca

# AttendanceMasterOut
source: Out
ru: Выход
vi: Giờ ra

# AttendanceMasterReportEmpDetailsTitle
source: Emp Details
ru: Подробнее
vi: Thông tin nhân viên

# AttendanceMasterStatus
source: Status
ru: Статус
vi: Trạng thái

# AttendanceMasterSumAB
source: AB
ru: Общ.кол-во присут.
vi: Tổng vắng

# AttendanceMasterSumLateHour
source: Late Hour
ru: Последний час
vi: Giờ trễ

# AttendanceMasterSumOT
source: OT
ru: Раб.вр.
vi: Số lần tăng ca

# AttendanceMasterSumOTHour
source: OT Hour
ru: Вр.раб
vi: Giờ tăng ca

# AttendanceMasterSumPR
source: PR
ru: Общ.кол-во отсут.
vi: Tổng có mặt

# AttendanceMasterSumWO
source: WO
ru: Вых
vi: Ngày nghỉ

# AttendanceMasterSumWorkHour
source: Work Hour
ru: Рабочее время
vi: Giờ làm việc

# AttendanceMasterWH
source: WH
ru: РВ
vi: Giờ làm việc

# DailyReportCheckInTitle
source: Check In
ru: Войти
vi: Giờ vào

# DailyReportCheckOutTitle
source: Check Out
ru: Выйти
vi: Giờ ra

# DailyReportDateTitle
source: Date
ru: Дата
vi: Ngày

# DailyReportDepartmentTitle
source: Department
ru: Департамент
vi: Bộ phận

# DailyReportDesignationTitle
source: Designation
ru: Наименование
vi: Chức vụ

# DailyReportEarlyTitle
source: Early
ru: Ранний
vi: Sớm

# DailyReportLateTitle
source: Late
ru: Опаздания
vi: Trễ

# DailyReportRemarksTitle
source: Remarks
ru: Примечания
vi: Trạng thái

# DailyReportShiftEndTitle
source: Shift End
ru: Конец смены
vi: Kết thúc ca

# DailyReportShiftStartTitle
source: Shift Start
ru: Начало смены
vi: Bắt đầu ca

# DailyReportShiftTitle
source: Shift
ru: Смена
vi: Tên ca

# DailyReportTotalAbsent
source: Total Absent
ru: Отсутствует всего
vi: Tổng vắng

# DailyReportTotalEarly
source: Total Early
ru: Раньше пришли
vi: Tổng sớm

# DailyReportTotalLate
source: Total Late
ru: Всего опаздали
vi: Tổng trễ

# DailyReportTotalPresent
source: Total Present
ru: Присутствует всего
vi: Tổng có mặt

# PeriodicMasterDepartmentTitle
source: Department
ru: Департамент
vi: Bộ phận

# PeriodicMasterDesignationTitle
source: Designation
ru: Наименование
vi: Chức vụ

# PeriodicMasterEmpName
source: Emp Name
ru: Имя сотрудника
vi: Tên nhân viên

# PeriodicMasterEmpNo
source: Emp No.
ru: Номер сотрудника
vi: Số nhân viên

# ReportRemarkHO
source: HO
ru: Вых.
vi: Ngày lễ

# ReportRemarkA
source: A
ru: Отсут.
vi: Vắng

# ReportRemarkP
source: P
ru: Присут.
vi: Có mặt

# ReportRemarkPX
source: PX
ru: Один. пропуск
vi: Thiếu giờ công

# DailyReportOTTitle
source: OT
ru: Вр.раб.
vi: Tăng ca

# AttendanceMasterEarly
source: Early
ru: Раньше
vi: Số lần sớm

# AttendanceMasterSumEarly
source: Early
ru: Раньше
vi: Số lần sớm

# AttendanceMasterSumEarlyHour
source: Early Hour
ru: Раньше(часы)
vi: Giờ sớm

# Deleted
source: 已删除
ru: Удалено

source: Summary
ru: Резюме

# AppIsFinishJobInBackground
source: 程序正在后台完成计算任务，请耐心等待
ru: Программа выполняет задачу в фоновом режиме

# AppIsRunningInBackground
source: 程序已经运行或者正在退出，请不要重复运行
ru: Программа уже запущена

# ResetPassword
source: 重置密码
ru: сбросить пароль {0}

# AttendanceMasterEmpNo
source: EmpNo
vi: Số nhân viên

# AttendanceMasterSumLT
source: LT
vi: Số lần trễ

# DailyReportEmpNameTitle
source: Emp Name
vi: Tên nhân viên

# DailyReportEmpNumberTitle
source: Emp No.
vi: Số nhân viên

# DailyReportWHTitle
source: WH
vi: Giờ làm việc
